In [1]:
import pandas as pd

In [3]:
empty_df = pd.DataFrame()
print (empty_df)

Empty DataFrame
Columns: []
Index: []

In [9]:
#print name_df and name_df, print out different outcomes, visually
Continents = ['North America','South America', 'Africa', 'Asia','Europe', 'Antarctica','Australia']
name_df = pd.DataFrame(Continents, columns= ['Name'])
name_df

            Name
0  North America
1  South America
2         Africa
3           Asia
4         Europe
5     Antarctica
6      Australia

In [28]:
continent_area = [9540000, 6890000, 11668599, 17212000, 3930000, 5400000, 3291903]

In [29]:
continent_area_msqmi = []

In [30]:
for i in continent_area:
    continent_area_msqmi.append (i/(10**6))

In [33]:
area_df = pd.DataFrame (continent_area_msqmi, columns=['Area (msqmi)'])
area_df

   Area (msqmi)
0      9.540000
1      6.890000
2     11.668599
3     17.212000
4      3.930000
5      5.400000
6      3.291903

In [34]:
continent_name_area = list(zip(Continents, continent_area_msqmi))
continent_name_area

[('North America', 9.54),
 ('South America', 6.89),
 ('Africa', 11.668599),
 ('Asia', 17.212),
 ('Europe', 3.93),
 ('Antarctica', 5.4),
 ('Australia', 3.291903)]

In [36]:
continent_name_area_1 = pd.DataFrame (continent_name_area, columns= ['Name','Area (Msqmi)'])
continent_name_area_1

            Name  Area (Msqmi)
0  North America      9.540000
1  South America      6.890000
2         Africa     11.668599
3           Asia     17.212000
4         Europe      3.930000
5     Antarctica      5.400000
6      Australia      3.291903

In [40]:
weather_data = pd.read_csv ('london_weather.csv')

In [42]:
weather_data.shape

(1383, 7)

In [44]:
#from beginning
weather_data.head(3)

,Unnamed: 0,Date,Max.TemperatureC,Min.TemperatureC,Max.Gust.SpeedKPH,Events,Season
0,1,1996-06-30,NaN,NaN,NaN,NaN,Summer
1,2,1996-07-01,19.0,11.0,28.0,Rain,Summer
2,3,1996-07-02,20.0,10.0,NaN,NaN,Summer

In [46]:
#from the end
weather_data.tail(3)

,Unnamed: 0,Date,Max.TemperatureC,Min.TemperatureC,Max.Gust.SpeedKPH,Events,Season
1380,1385,2000-06-28,21.0,13.0,NaN,NaN,Summer
1381,1386,2000-06-29,20.0,14.0,NaN,Rain-Thunderstorm,Summer
1382,1387,2000-06-30,20.0,14.0,NaN,Rain,Summer

In [47]:
weather_data.columns

Index(['Unnamed: 0', 'Date', 'Max.TemperatureC', 'Min.TemperatureC',
       'Max.Gust.SpeedKPH', 'Events', 'Season'],
      dtype='object')

In [49]:
weather_data [:2]

,Unnamed: 0,Date,Max.TemperatureC,Min.TemperatureC,Max.Gust.SpeedKPH,Events,Season
0,1,1996-06-30,NaN,NaN,NaN,NaN,Summer
1,2,1996-07-01,19.0,11.0,28.0,Rain,Summer

In [52]:
weather_data['Min.TemperatureC'].max()

21.0

In [54]:
#gives summary of numerical data from frame
weather_data.describe()

        Unnamed: 0  Max.TemperatureC  Min.TemperatureC  Max.Gust.SpeedKPH
count  1383.000000       1372.000000       1382.000000         419.000000
mean    693.881417         15.505102          8.151954          32.000000
std     400.505284          6.369429          5.113349           7.174183
min       1.000000         -2.000000         -5.000000          18.000000
25%     347.500000         11.000000          4.000000          28.000000
50%     694.000000         15.000000          9.000000          31.000000
75%    1040.500000         20.000000         12.000000          36.000000
max    1387.000000         33.000000         21.000000          66.000000

In [55]:
weather_data.describe(exclude= None)

        Unnamed: 0  Max.TemperatureC  Min.TemperatureC  Max.Gust.SpeedKPH
count  1383.000000       1372.000000       1382.000000         419.000000
mean    693.881417         15.505102          8.151954          32.000000
std     400.505284          6.369429          5.113349           7.174183
min       1.000000         -2.000000         -5.000000          18.000000
25%     347.500000         11.000000          4.000000          28.000000
50%     694.000000         15.000000          9.000000          31.000000
75%    1040.500000         20.000000         12.000000          36.000000
max    1387.000000         33.000000         21.000000          66.000000